fio/results/fio-res_201904210400
Seq-Read-1m: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq-Write-1m: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4k-32qd: (g=2): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4k-32qd: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.1
Starting 4 processes
3;fio-3.1;Seq-Read-1m;0;0;688128;68702;67;10016;52;499;80.251010;22.588414;2761;20431;14817.378690;4115.956135;1.000000%=2899;5.000000%=3325;10.000000%=4358;20.000000%=15925;30.000000%=16187;40.000000%=16187;50.000000%=16318;60.000000%=16318;70.000000%=16318;80.000000%=16449;90.000000%=16580;95.000000%=16908;99.000000%=18219;99.500000%=18481;99.900000%=20316;99.950000%=20316;99.990000%=20316;0%=0;0%=0;0%=0;2817;20529;14898.466507;4122.089869;47407;158024;78.584397%;53989.052632;25205.488779;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.000000%;0.678982%;673;0;288;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;9.08%;2.53%;88.24%;0.15%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39062;36294;0;1;365852;362418;728420;98.01%
3;fio-3.1;Seq-Write-1m;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;688128;68723;67;10013;55;185;98.039097;22.635962;2997;43184;14795.931259;4668.783984;1.000000%=3096;5.000000%=3325;10.000000%=3555;20.000000%=16056;30.000000%=16187;40.000000%=16187;50.000000%=16318;60.000000%=16318;70.000000%=16318;80.000000%=16318;90.000000%=16449;95.000000%=16580;99.000000%=19791;99.500000%=31064;99.900000%=43253;99.950000%=43253;99.990000%=43253;0%=0;0%=0;0%=0;3069;43317;14894.796580;4675.405666;52965;169782;87.275998%;59978.684211;26604.113074;0.099880%;0.689173%;673;0;27;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;11.61%;1.19%;86.31%;0.89%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39062;36294;0;1;365852;362418;728420;98.01%
3;fio-3.1;Rand-Read-4k-32qd;2;0;134744;13459;3364;10011;2;59;9.068945;3.075923;304;20270;9496.270466;2931.640438;1.000000%=618;5.000000%=823;10.000000%=4620;20.000000%=10027;30.000000%=10158;40.000000%=10289;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10682;95.000000%=11337;99.000000%=13172;99.500000%=14090;99.900000%=16187;99.950000%=17170;99.990000%=19267;0%=0;0%=0;0%=0;310;20278;9505.984449;2932.262357;9960;32235;82.905980%;11158.315789;5103.967629;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;3.526474%;3.526474%;31322;0;62;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.20%;2.83%;5.28%;1.33%;0.32%;8.29%;81.74%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39062;36294;0;1;365852;362418;728420;98.01%
3;fio-3.1;Rand-Write-4k-32qd;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;125000;12486;3121;10011;2;48;10.009974;2.506933;690;64818;10236.431280;2764.182369;1.000000%=2056;5.000000%=8716;10.000000%=10289;20.000000%=10420;30.000000%=10420;40.000000%=10420;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10551;95.000000%=10551;99.000000%=13565;99.500000%=20316;99.900000%=51118;99.950000%=60555;99.990000%=64749;0%=0;0%=0;0%=0;707;64830;10247.054257;2764.374857;12176;17296;100.000000%;12486.350000;1132.236040;2.277722%;4.565435%;30712;0;28;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;0.04%;0.77%;3.51%;1.19%;93.97%;0.39%;0.11%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39062;36294;0;1;365852;362418;728420;98.01%

Seq-Read-1m: (groupid=0, jobs=1): err= 0: pid=29368: Sun Apr 21 04:00:43 2019
   read: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10016msec)
    slat (usec): min=52, max=499, avg=80.25, stdev=22.59
    clat (usec): min=2761, max=20431, avg=14817.38, stdev=4115.96
     lat (usec): min=2817, max=20529, avg=14898.47, stdev=4122.09
    clat percentiles (usec):
     |  1.00th=[ 2900],  5.00th=[ 3326], 10.00th=[ 4359], 20.00th=[15926],
     | 30.00th=[16188], 40.00th=[16188], 50.00th=[16319], 60.00th=[16319],
     | 70.00th=[16319], 80.00th=[16450], 90.00th=[16581], 95.00th=[16909],
     | 99.00th=[18220], 99.50th=[18482], 99.90th=[20317], 99.95th=[20317],
     | 99.99th=[20317]
   bw (  KiB/s): min=47407, max=158024, per=78.58%, avg=53989.05, stdev=25205.49, samples=19
   iops        : min=   46, max=  154, avg=52.16, stdev=24.67, samples=19
  lat (msec)   : 4=9.08%, 10=2.53%, 20=88.24%, 50=0.15%
  cpu          : usr=0.00%, sys=0.68%, ctx=673, majf=0, minf=288
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=672,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq-Write-1m: (groupid=1, jobs=1): err= 0: pid=29369: Sun Apr 21 04:00:43 2019
  write: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10013msec)
    slat (usec): min=55, max=185, avg=98.04, stdev=22.64
    clat (usec): min=2997, max=43184, avg=14795.93, stdev=4668.78
     lat (usec): min=3069, max=43317, avg=14894.80, stdev=4675.41
    clat percentiles (usec):
     |  1.00th=[ 3097],  5.00th=[ 3326], 10.00th=[ 3556], 20.00th=[16057],
     | 30.00th=[16188], 40.00th=[16188], 50.00th=[16319], 60.00th=[16319],
     | 70.00th=[16319], 80.00th=[16319], 90.00th=[16450], 95.00th=[16581],
     | 99.00th=[19792], 99.50th=[31065], 99.90th=[43254], 99.95th=[43254],
     | 99.99th=[43254]
   bw (  KiB/s): min=52965, max=169782, per=87.28%, avg=59978.68, stdev=26604.11, samples=19
   iops        : min=   51, max=  165, avg=57.95, stdev=25.94, samples=19
  lat (msec)   : 4=11.61%, 10=1.19%, 20=86.31%, 50=0.89%
  cpu          : usr=0.10%, sys=0.69%, ctx=673, majf=0, minf=27
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,672,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4k-32qd: (groupid=2, jobs=1): err= 0: pid=29370: Sun Apr 21 04:00:43 2019
   read: IOPS=3364, BW=13.1MiB/s (13.8MB/s)(132MiB/10011msec)
    slat (nsec): min=2715, max=59049, avg=9068.94, stdev=3075.92
    clat (usec): min=304, max=20270, avg=9496.27, stdev=2931.64
     lat (usec): min=310, max=20278, avg=9505.98, stdev=2932.26
    clat percentiles (usec):
     |  1.00th=[  619],  5.00th=[  824], 10.00th=[ 4621], 20.00th=[10028],
     | 30.00th=[10159], 40.00th=[10290], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10683], 95.00th=[11338],
     | 99.00th=[13173], 99.50th=[14091], 99.90th=[16188], 99.95th=[17171],
     | 99.99th=[19268]
   bw (  KiB/s): min= 9960, max=32235, per=82.91%, avg=11158.32, stdev=5103.97, samples=19
   iops        : min= 2490, max= 8058, avg=2789.11, stdev=1275.93, samples=19
  lat (usec)   : 500=0.20%, 750=2.83%, 1000=5.28%
  lat (msec)   : 2=1.33%, 4=0.32%, 10=8.29%, 20=81.74%, 50=0.01%
  cpu          : usr=3.53%, sys=3.53%, ctx=31322, majf=0, minf=62
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=33686,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4k-32qd: (groupid=3, jobs=1): err= 0: pid=29371: Sun Apr 21 04:00:43 2019
  write: IOPS=3121, BW=12.2MiB/s (12.8MB/s)(122MiB/10011msec)
    slat (nsec): min=2955, max=48019, avg=10009.97, stdev=2506.93
    clat (usec): min=690, max=64818, avg=10236.43, stdev=2764.18
     lat (usec): min=707, max=64830, avg=10247.05, stdev=2764.37
    clat percentiles (usec):
     |  1.00th=[ 2057],  5.00th=[ 8717], 10.00th=[10290], 20.00th=[10421],
     | 30.00th=[10421], 40.00th=[10421], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10552], 95.00th=[10552],
     | 99.00th=[13566], 99.50th=[20317], 99.90th=[51119], 99.95th=[60556],
     | 99.99th=[64750]
   bw (  KiB/s): min=12176, max=17296, per=100.00%, avg=12486.35, stdev=1132.24, samples=20
   iops        : min= 3044, max= 4324, avg=3121.55, stdev=283.07, samples=20
  lat (usec)   : 750=0.02%, 1000=0.04%
  lat (msec)   : 2=0.77%, 4=3.51%, 10=1.19%, 20=93.97%, 50=0.39%
  lat (msec)   : 100=0.11%
  cpu          : usr=2.28%, sys=4.57%, ctx=30712, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,31250,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10016-10016msec

Run status group 1 (all jobs):
  WRITE: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10013-10013msec

Run status group 2 (all jobs):
   READ: bw=13.1MiB/s (13.8MB/s), 13.1MiB/s-13.1MiB/s (13.8MB/s-13.8MB/s), io=132MiB (138MB), run=10011-10011msec

Run status group 3 (all jobs):
  WRITE: bw=12.2MiB/s (12.8MB/s), 12.2MiB/s-12.2MiB/s (12.8MB/s-12.8MB/s), io=122MiB (128MB), run=10011-10011msec

Disk stats (read/write):
  xvda: ios=39062/36294, merge=0/1, ticks=365852/362418, in_queue=728420, util=98.01%